app/controllers/api/expenses_controller.rb

  def destroy
    @expense = Expense.find_by(id: params[:id])
    if current_user.id == @expense.owner_id
      @expense.delete
---
DELETE FROM "expenses" WHERE "expenses"."id" = $1  [["id", 21]]