app/controllers/api/expenses_controller.rb

SELECT "expenses".* FROM "expenses" INNER JOIN "transactions" ON "expenses"."id" = "transactions"."expense_id" WHERE "transactions"."payer_id" = $1  [["payer_id", 1]]
---
  def index
    @expenses = current_user.expenses.includes(:owner, :transactions => [:payer]) + current_user.owed_expenses.includes(:owner, :transactions => [:payer])
    @transactions = []
    @expenses.each do |expense|

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "expenses" SET "amount" = $1, "name" = $2, "updated_at" = $3 WHERE "expenses"."id" = $4  [["amount", 200000], ["name", "WILL THIS CHANGE"], ["updated_at", "2020-05-01 00:09:47.225487"], ["id", 2]]
---
  def show
    @expense = Expense.find_by(id: params[:id])
    @transactions = []
    @expense.transactions.each {|transaction| @transactions.push(transaction)}

INSERT INTO "expenses" ("name", "amount", "owner_id", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "testing"], ["amount", 9200], ["owner_id", 1], ["date", "2020-04-25"], ["created_at", "2020-04-30 20:45:11.612445"], ["updated_at", "2020-04-30 20:45:11.612445"]]
---
  def create
    @expense = Expense.new(expense_params)
    @expense.owner_id = current_user.id
    if @expense.amount > 0
      if @expense.save

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "expenses" SET "amount" = $1, "name" = $2, "updated_at" = $3 WHERE "expenses"."id" = $4  [["amount", 200000], ["name", "WILL THIS CHANGE"], ["updated_at", "2020-05-01 00:09:47.225487"], ["id", 2]]
SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def update
    @expense = Expense.find_by(id: params[:id])
    if @expense.owner_id == current_user.id
      if params[:expense][:amount].to_i > 0
        if @expense.update(expense_params)
          #refreshes @expense for non-table values
          @expense = Expense.find_by(id: @expense.id).includes(:transactions)

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = $1  [["id", 1]]
---
  def destroy
    @expense = Expense.find_by(id: params[:id])
    @transactions = []
    @expense.transactions.each {|transaction| @transactions.push(transaction)}

    if current_user.id == @expense.owner_id
      @expense.destroy